holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
/** -------------------------------------------------------------------------------------
 * 
 */

#include "bsp/esp32_p4_wifi6_touch_lcd_xc.h"
#include <limits.h>
#include "esp_log.h"
#include "lvgl.h"
// #include "./strval.h"
#include <stdlib.h>       // malloc/free
#include "ff.h"           // FatFs core
#include "diskio.h"       // Disk I/O
#include "diskio_impl.h"  // ESP32 disk impl
#include "esp_vfs_fat.h"  // VFS integration
#include "sdmmc_cmd.h"
#include "driver/sdmmc_host.h"
#include "esp_err.h"
#include "sd_pwr_ctrl_by_on_chip_ldo.h"
#include <stdio.h>
#include <dirent.h>
#include "bsp/esp-bsp.h"

#include <stdio.h>
#include <limits.h>
#include <string.h>
// #include <iostream>
#include <assert.h>
#include <float.h>
#include <math.h>
#include <Arduino.h>
// #include <Wire.h>

#include "./config.h"
#include "./REG.h"
#include "./strval.h"
#include "./meteors.h"
#include "./wtgps300p.h"
#include "./wt901.h"
#include "./multiplexers.h"
#include "./sidereal_helper.h"
#include "./hextodig.h"
#include "./ins.h"
#include "./satio.h"
#include "./custommapping.h"
#include "./matrix.h"
#include "./serial_infocmd.h"
#include "./system_data.h"
#include "./sdcard_helper.h"
#include "./task_handler.h"
// #include "./multi_display_controller.h"
#include "./i2c_helper.h"
#include "./wit_c_sdk.h"
#include "./astroclock.h"
#include "./satio_file.h"

#include <sys/time.h>
#include <rtc_wdt.h>
#include <esp_task_wdt.h>
#include "esp_pm.h"
#include "esp_attr.h"
#include "esp_log.h"
#include "esp_partition.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_partition.h"
#include "esp_spiffs.h"
#include "esp_heap_caps.h"
#include "nvs_flash.h"
#include "esp_system.h"
#include "driver/uart.h"

#include "./satio_lvgl.h"

/** ---------------------------------------------------------------------------------------
 * @brief Screens
 */

lv_timer_t * display_timer=NULL;

lv_obj_t * loading_screen;
lv_obj_t * home_screen;
lv_obj_t * matrix_screen;
lv_obj_t * gps_screen;
lv_obj_t * gyro_screen;
lv_obj_t * disp_screen;
lv_obj_t * system_screen;
lv_obj_t * uap_screen;

bool flag_display_loading_screen = false;
bool flag_display_home_screen = false;
bool flag_display_matrix_screen = false;
bool flag_display_gps_screen = false;
bool flag_display_gyro_screen = false;
bool flag_display_disp_screen = false;
bool flag_display_system_screen = false;
bool flag_display_uap_screen = false;

bool update_matrix_screen=false;

/** ---------------------------------------------------------------------------------------
 * @brief Global Objects
 */
lv_obj_t * label_enter_str;
lv_obj_t * text_area_1_obj;

lv_obj_t * label_enter_digits;
lv_obj_t * text_area_2_obj;

lv_obj_t * grid_menu_x;
lv_obj_t * drop_down_menu_x;

menu_struct menu_x;

keyboard_t kb_numdec;
keyboard_t kb_alnumsym;

lv_obj_t * slider_brightness;
int32_t slider_brightness_value = 0;
int32_t slider_outline_width = 2;

title_bar_t main_title_bar;
system_tray_t system_tray;

// Loading screen image (freed when switching to home screen)
static sdcard_image_t * loading_image = NULL;

lv_obj_t * title_bar_local_time_label;
lv_obj_t * title_bar_local_date_label;

lv_obj_t * matrix_overview_grid_1;
lv_obj_t * dropdown_menu_matrix_switch_select;
int current_matrix_i = 0;
int current_mapping_i = 0;
int current_matrix_function_i = 0;
matrix_function_container_t mfc;
mapping_config_container_t mcc;

button_t matrix_new;
button_t matrix_save;
button_t matrix_load;
button_t matrix_delete;
lv_obj_t * dd_matrix_file_slot_select;
button_t switch_matrix_mapping_panel;
int current_matrix_panel_view=0;
#define MAX_MATRIX_PANEL_VIEWS 2

/** ---------------------------------------------------------------------------------------
 * @brief Global Style
 */
// ---------------------------
// Color
// ---------------------------

// Rainbow Effect
bool enable_rainbow_effect=true;

// Current Hue
uint32_t current_hue=0;

// Default Color Major
lv_color_t default_bg_hue;
lv_color_t default_outline_hue;
lv_color_t default_border_hue;
lv_color_t default_shadow_hue;
lv_color_t default_title_hue;
lv_color_t default_value_hue;
// Default Color Minor
lv_color_t default_contrast_bg_hue;
lv_color_t default_contrast_outline_hue;
lv_color_t default_contrast_border_hue;
lv_color_t default_contrast_shadow_hue;
lv_color_t default_contrast_title_hue;
lv_color_t default_contrast_value_hue;

// Custom Color Major
lv_color_t custom_bg_hue;
lv_color_t custom_outline_hue;
lv_color_t custom_border_hue;
lv_color_t custom_shadow_hue;
lv_color_t custom_title_hue;
lv_color_t custom_value_hue;
// Custom Color Minor
lv_color_t custom_contrast_bg_hue;
lv_color_t custom_contrast_outline_hue;
lv_color_t custom_contrast_border_hue;
lv_color_t custom_contrast_shadow_hue;
lv_color_t custom_contrast_title_hue;
lv_color_t custom_contrast_value_hue;

// Current Color Major (Is set as default/custom)
lv_color_t main_bg_hue;
lv_color_t main_outline_hue;
lv_color_t main_border_hue;
lv_color_t main_shadow_hue;
lv_color_t main_title_hue;
lv_color_t main_value_hue;
// Current Color Minor (Is set as default/custom)
lv_color_t main_contrast_bg_hue;
lv_color_t main_contrast_outline_hue;
lv_color_t main_contrast_border_hue;
lv_color_t main_contrast_shadow_hue;
lv_color_t main_contrast_title_hue;
lv_color_t main_contrast_value_hue;

// ---------------------------
// Size
// ---------------------------
int32_t outline_width = 2;
int32_t border_width  = 0;
int32_t shadow_width  = 0;
// ---------------------------
// Radius
// ---------------------------
int32_t radius_square  = 0;
int32_t radius_rounded = 5;
int32_t radius_circle  = 360;
int32_t general_radius = 0;
// ---------------------------
// Font
// ---------------------------
static const lv_font_t * font_menu_title;
static const lv_font_t * font_menu_item;

