holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Allocate pages arrays
    result.max_pages = max_pages;
    result.pages = (lv_obj_t **)malloc(max_pages * sizeof(lv_obj_t *));
    result.page_items = (lv_obj_t ***)malloc(max_pages * sizeof(lv_obj_t **));
    result.page_item_counts = (uint32_t *)calloc(max_pages, sizeof(uint32_t));
    
    // Allocate items arrays for each page
    result.max_items_per_page = 10;  // Max items per page
    for(int p = 0; p < max_pages; p++) {
        result.page_items[p] = (lv_obj_t **)malloc(result.max_items_per_page * sizeof(lv_obj_t *));
    }

    // Create menu
    result.menu = lv_menu_create(scr);

    // Size and position
    lv_obj_set_size(result.menu, size_w_px, size_h_px);
    lv_obj_align(result.menu, (lv_align_t)alignment, pos_x, pos_y);

    /* --- MENU LV_PART_MAIN ----------------------------------------------------------- */

    // Size and position
    lv_obj_set_style_transform_width(result.menu, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_row(result.menu, 4, LV_PART_MAIN);
    lv_obj_set_style_pad_column(result.menu, 2, LV_PART_MAIN);

    // Main style: radius
    lv_obj_set_style_radius(result.menu, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.menu, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.menu, default_outline_hue, LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(result.menu, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.menu, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(result.menu, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.menu, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.menu, default_shadow_hue, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(result.menu, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.menu, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.menu, font_menu_item, LV_PART_MAIN);

    /* --- MENU LV_PART_ITEMS ---------------------------------------------------------- */

    lv_obj_set_style_border_width(result.menu, border_width, LV_PART_ITEMS);

    /* --- MAIN HEADER ----------------------------------------------------------------- */

    // Create main header
    result.main_header = lv_menu_get_main_header(result.menu);

    /* --- MAIN HEADER LV_PART_MAIN ---------------------------------------------------- */

    // Size and position
    lv_obj_set_style_pad_all(result.main_header, 12, LV_PART_MAIN);

    // Main style: radius
    lv_obj_set_style_radius(result.main_header, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.main_header, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.main_header, default_outline_hue, LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(result.main_header, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.main_header, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(result.main_header, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.main_header, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.main_header, default_shadow_hue, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(result.main_header, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.main_header, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.main_header, font_menu_title, LV_PART_MAIN);

    /* --- ROOT BACK BUTTON ------------------------------------------------------------ */
    
    // Enable root back button
    lv_menu_set_mode_root_back_button(result.menu, LV_MENU_ROOT_BACK_BUTTON_ENABLED);

    // Create back button
    result.back_button = lv_menu_get_main_header_back_button(result.menu);

    // Create back button label
    result.back_label = lv_obj_get_child(result.back_button, 0);

    /* --- ROOT BACK BUTTON LV_PART_MAIN ------------------------------------------------- */

    // Size and position
    lv_obj_set_style_pad_all(result.back_button, 8, LV_PART_MAIN);

    // Main style: radius
    lv_obj_set_style_radius(result.back_button, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.back_button, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.back_button, default_outline_hue, LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(result.back_button, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.back_button, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(result.back_button, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.back_button, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.back_button, default_shadow_hue, LV_PART_MAIN);

    // Main style: text
    lv_obj_set_style_text_align(result.back_button, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.back_button, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.back_button, font_menu_item, LV_PART_MAIN);

    /* --- ROOT BACK BUTTON LABEL LV_PART_MAIN ----------------------------------------- */

    // Main style: radius
    lv_obj_set_style_radius(result.back_label, general_radius, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.back_label, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.back_label, default_outline_hue, LV_PART_MAIN);

    // Main style: border
    lv_obj_set_style_border_width(result.back_label, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.back_label, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_color(result.back_label, default_bg_hue, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.back_label, shadow_width, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.back_label, default_shadow_hue, LV_PART_MAIN);

