holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Main style: text
    lv_obj_set_style_text_align(result.label, text_align, LV_PART_MAIN);
    lv_obj_set_style_text_font(result.label, font_menu_item, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label, default_title_hue, LV_PART_MAIN);

    // Size and position (Center the (now auto-sized) label inside panel)
    lv_obj_center(result.label);

    // Label Flags & Events
    lv_obj_clear_flag(result.label, LV_OBJ_FLAG_CLICKABLE); // delegate clicks to lower layer (btn)
    lv_obj_clear_flag(result.label, LV_OBJ_FLAG_CLICK_FOCUSABLE); // delegate focus to lower layer (btn)

    // Button Flags & Events
    lv_obj_add_flag(result.button, LV_OBJ_FLAG_CLICKABLE);

    return result;
}

/** ----------------------------------------------------------------------------------------
 * @brief Create Matrix Function Container
 * 
 * Creates a container panel with all elements needed to display/edit matrix function data:
 * - Function Slot
 * - Function Name
 * - XYZ Coordinates (3 values)
 * - Operator Name
 * - Output Mode
 * - Output PWM (2 values)
 * - Port Map
 * 
 * @param scr Pointer to the parent screen object.
 * @param width_px Width of the container in pixels.
 * @param height_px Height of the container in pixels.
 * @param alignment Alignment of the container within its parent/screen.
 * @param pos_x X position of the container.
 * @param pos_y Y position of the container.
 * @return matrix_function_container_t struct with all UI element pointers.
 */
matrix_function_container_t create_matrix_function_container(
    lv_obj_t * scr,
    int32_t width_px,
    int32_t height_px,
    int32_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    int32_t radius,
    int32_t padding,
    int32_t row_height,
    int32_t row_spacing,
    bool show_scrollbar,
    bool enable_scrolling,
    const lv_font_t * font_title,
    const lv_font_t * font_sub
) {
    matrix_function_container_t result = {0};

    // Row Object Widths
    int32_t label_width_0 = 80;
    int32_t value_width_0 = ((width_px/2) - label_width_0) - padding*2;
    int32_t label_width_1 = 80;
    int32_t value_width_1 = ((width_px/2) - label_width_1) - padding*2;
    int32_t label_width_2 = 80;
    int32_t value_width_2 = ((width_px/2) - label_width_2) - padding*2;
    
    /* --- MAIN PANEL ------------------------------------------------------------------ */
    
    result.panel = lv_obj_create(scr);
    lv_obj_set_size(result.panel, width_px, height_px);
    lv_obj_align(result.panel, (lv_align_t)alignment, pos_x, pos_y);

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(result.panel, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(result.panel, LV_DIR_NONE);}
    
    // Panel style
    lv_obj_set_style_radius(result.panel, general_radius, LV_PART_MAIN);
    lv_obj_set_style_outline_width(result.panel, outline_width, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.panel, default_outline_hue, LV_PART_MAIN);
    lv_obj_set_style_border_width(result.panel, border_width, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.panel, default_border_hue, LV_PART_MAIN);
    lv_obj_set_style_bg_color(result.panel, default_bg_hue, LV_PART_MAIN);
    lv_obj_set_style_pad_all(result.panel, padding, LV_PART_MAIN);
    lv_obj_set_scrollbar_mode(result.panel, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_set_flex_flow(result.panel, LV_FLEX_FLOW_COLUMN);
    lv_obj_set_flex_align(result.panel, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START, LV_FLEX_ALIGN_START);
    lv_obj_set_style_pad_row(result.panel, row_spacing, LV_PART_MAIN);
    lv_obj_set_style_radius(result.panel, radius, LV_PART_MAIN);
    lv_obj_set_style_outline_pad(result.panel, padding, LV_PART_MAIN);

    /* --- Function Slot ------------------------------------------------------- */
    lv_obj_t * row_index = lv_obj_create(result.panel);
    lv_obj_set_size(row_index, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_index, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_index, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_index, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_index, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_index, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_index,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_index, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_index, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_index, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_index, LV_DIR_NONE);}

    // const int32_t i_function_label_width = 80;
    // const int32_t i_function_value_width = (width_px/2 - i_function_label_width);

    // Row Object Widths
    label_width_0 = 80;
    value_width_0 = ((width_px/2) - label_width_0) - padding*2;
    label_width_1 = 80;
    value_width_1 = ((width_px/2) - label_width_1) - padding*2;

    // Switch Label
    result.label_switch_index_select = lv_label_create(row_index);
    lv_label_set_text(result.label_switch_index_select, "Switch");
    lv_obj_set_size(result.label_switch_index_select, label_width_0, row_height);
    lv_obj_set_style_text_font(result.label_switch_index_select, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_switch_index_select, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_switch_index_select, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);

    // Switch Value
    result.dd_switch_index_select = create_dropdown_menu(
        row_index,
        NULL,
        0,
        value_width_0,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_switch_index_select_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < 45; i++) {
        snprintf(dd_switch_index_select_name, sizeof(dd_switch_index_select_name), "%d", i);
        lv_dropdown_add_option(result.dd_switch_index_select, dd_switch_index_select_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_switch_index_select, current_matrix_i);
    lv_obj_add_event_cb(result.dd_switch_index_select, dd_switch_index_select_event_cb, LV_EVENT_VALUE_CHANGED, NULL);
    
    // Function Label
    result.label_function_index_select = lv_label_create(row_index);
    lv_label_set_text(result.label_function_index_select, "Function");
    lv_obj_set_size(result.label_function_index_select, label_width_1, row_height);
    lv_obj_set_style_text_font(result.label_function_index_select, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_function_index_select, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_function_index_select, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    // Function Value
    result.dd_function_index_select = create_dropdown_menu(
        row_index,
        NULL,
        0,
        value_width_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_function_index_select_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_SWITCH_FUNCTIONS; i++) {
        snprintf(dd_function_index_select_name, sizeof(dd_function_index_select_name), "%d", i);
        lv_dropdown_add_option(result.dd_function_index_select, dd_function_index_select_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_function_index_select, current_matrix_function_i);
    lv_obj_add_event_cb(result.dd_function_index_select, dd_function_index_select_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.label_switch_index_select, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_switch_index_select, value_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.label_function_index_select, label_width_1, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_function_index_select, value_width_1, LV_SIZE_CONTENT);
    
    /* --- Function Name ------------------------------------------------------- */
    
    lv_obj_t * row_input_value = lv_obj_create(result.panel);
    lv_obj_set_size(row_input_value, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_input_value, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_input_value, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_input_value, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_input_value, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_input_value, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_input_value,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_input_value, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_input_value, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_input_value, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_input_value, LV_DIR_NONE);}

