holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Row Object Widths
    label_width_0 = 20;
    value_width_0 = ((width_px) - label_width_0) - padding*2;
    label_width_1 = NULL;
    value_width_1 = NULL;
    
    result.label_function_name = lv_label_create(row_input_value);
    lv_label_set_text(result.label_function_name, "In");
    lv_obj_set_size(result.label_function_name, label_width_0, row_height);
    lv_obj_set_style_text_font(result.label_function_name, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_function_name, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_function_name, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    result.dd_function_name = create_dropdown_menu(
        row_input_value,
        NULL,
        0,
        value_width_0,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_function_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_NAMES; i++) {
        snprintf(dd_function_name, sizeof(dd_function_name), "%s", matrixData.matrix_function_names[i]);
        lv_dropdown_add_option(result.dd_function_name, dd_function_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_function_name, matrixData.matrix_function[0][current_matrix_i][current_matrix_function_i]);
    lv_obj_add_event_cb(result.dd_function_name, dd_function_name_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.label_function_name, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_function_name, value_width_0, LV_SIZE_CONTENT);
    
    /* --- X Value ------------------------------------------------------------- */
    
    lv_obj_t * row_value_x = lv_obj_create(result.panel);
    lv_obj_set_size(row_value_x, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_value_x, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_value_x, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_value_x, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_value_x, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_value_x, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_value_x,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_value_x, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_value_x, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_value_x, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_value_x, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 20;
    label_width_1 = 120;
    value_width_0 = (width_px - label_width_1 - label_width_0) - padding*3;
    value_width_1 = NULL;
    
    result.label_x = lv_label_create(row_value_x);
    lv_label_set_text(result.label_x, "X");
    lv_obj_set_size(result.label_x, label_width_0, row_height);
    lv_obj_set_style_text_font(result.label_x, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_x, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_x, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    // User X
    result.ta_x = create_textarea(
        row_value_x,            // lv_obj_t
        value_width_0, // width px
        row_height,      // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,        // font for labels
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_x, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]).c_str());
    lv_obj_add_event_cb(result.ta_x, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_x, &matrix_value_x_ctx);

    // System X
    result.dd_x = create_dropdown_menu(
        row_value_x,
        NULL,
        0,
        value_width_0,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_x_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_NAMES; i++) {
        snprintf(dd_x_name, sizeof(dd_x_name), "%s", matrixData.matrix_function_names[i]);
        lv_dropdown_add_option(result.dd_x, dd_x_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_x, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]);
    lv_obj_add_event_cb(result.dd_x, dd_x_event_cb, LV_EVENT_VALUE_CHANGED, NULL);
    lv_obj_add_flag(result.dd_x, LV_OBJ_FLAG_HIDDEN);

    // X Mode Select
    result.dd_mode_x = create_dropdown_menu(
        row_value_x,
        NULL,
        0,
        label_width_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_mode_x_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_XYZ_MODES; i++) {
        snprintf(dd_mode_x_name, sizeof(dd_mode_x_name), "%s", String(matrixData.matrix_function_mode_xyz_name[i]).c_str());
        lv_dropdown_add_option(result.dd_mode_x, dd_mode_x_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_mode_x, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]);
    lv_obj_add_event_cb(result.dd_mode_x, dd_mode_x_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.label_x, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.ta_x, value_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_x, value_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_mode_x, label_width_1, LV_SIZE_CONTENT);
    
