holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    /* --- Y Value ------------------------------------------------------------- */
    
    lv_obj_t * row_value_y = lv_obj_create(result.panel);
    lv_obj_set_size(row_value_y, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_value_y, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_value_y, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_value_y, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_value_y, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_value_y, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_value_y,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );
    
    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_value_y, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_value_y, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_value_y, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_value_y, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 20;
    label_width_1 = 120;
    value_width_0 = (width_px - label_width_1 - label_width_0) - padding*3;
    value_width_1 = NULL;

    result.label_y = lv_label_create(row_value_y);
    lv_label_set_text(result.label_y, "Y");
    lv_obj_set_size(result.label_y, label_width_0, row_height);
    lv_obj_set_style_text_font(result.label_y, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_y, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_y, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    // User Y
    result.ta_y = create_textarea(
        row_value_y,            // lv_obj_t
        value_width_0, // width px
        row_height,      // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_y, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]).c_str());
    lv_obj_add_event_cb(result.ta_y, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_y, &matrix_value_y_ctx);

    // System Y
    result.dd_y = create_dropdown_menu(
        row_value_y,
        NULL,
        0,
        value_width_0,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_y_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_NAMES; i++) {
        snprintf(dd_y_name, sizeof(dd_y_name), "%s", matrixData.matrix_function_names[i]);
        lv_dropdown_add_option(result.dd_y, dd_y_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_y, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]);
    lv_obj_add_event_cb(result.dd_y, dd_y_event_cb, LV_EVENT_VALUE_CHANGED, NULL);
    lv_obj_add_flag(result.dd_y, LV_OBJ_FLAG_HIDDEN);

    // Y Mode Select
    result.dd_mode_y = create_dropdown_menu(
        row_value_y,
        NULL,
        0,
        label_width_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_mode_y_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_XYZ_MODES; i++) {
        snprintf(dd_mode_y_name, sizeof(dd_mode_y_name), "%s", String(matrixData.matrix_function_mode_xyz_name[i]).c_str());
        lv_dropdown_add_option(result.dd_mode_y, dd_mode_y_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_mode_y, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]);
    lv_obj_add_event_cb(result.dd_mode_y, dd_mode_y_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.label_y, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.ta_y, value_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_y, value_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_mode_y, label_width_1, LV_SIZE_CONTENT);

    /* --- Z Value ------------------------------------------------------------- */
    
    lv_obj_t * row_value_z = lv_obj_create(result.panel);
    lv_obj_set_size(row_value_z, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_value_z, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_value_z, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_value_z, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_value_z, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_value_z, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_value_z,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_value_z, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_value_z, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_value_z, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_value_z, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 20;
    label_width_1 = 120;
    value_width_0 = (width_px - label_width_1 - label_width_0) - padding*3;
    value_width_1 = NULL;
    
    result.label_z = lv_label_create(row_value_z);
    lv_label_set_text(result.label_z, "Z");
    lv_obj_set_size(result.label_z, label_width_0, row_height);
    lv_obj_set_style_text_font(result.label_z, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_z, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_z, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    // User Z
    result.ta_z = create_textarea(
        row_value_z,            // lv_obj_t
        value_width_0, // width px
        row_height,      // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_z, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]).c_str());
    lv_obj_add_event_cb(result.ta_z, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_z, &matrix_value_z_ctx);

