holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // System Z
    result.dd_z = create_dropdown_menu(
        row_value_z,
        NULL,
        0,
        value_width_0,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_z_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_NAMES; i++) {
        snprintf(dd_z_name, sizeof(dd_z_name), "%s", matrixData.matrix_function_names[i]);
        lv_dropdown_add_option(result.dd_z, dd_z_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_z, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]);
    lv_obj_add_event_cb(result.dd_z, dd_z_event_cb, LV_EVENT_VALUE_CHANGED, NULL);
    lv_obj_add_flag(result.dd_z, LV_OBJ_FLAG_HIDDEN);

    // Z Mode Select
    result.dd_mode_z = create_dropdown_menu(
        row_value_z,
        NULL,
        0,
        label_width_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_mode_z_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_XYZ_MODES; i++) {
        snprintf(dd_mode_z_name, sizeof(dd_mode_z_name), "%s", String(matrixData.matrix_function_mode_xyz_name[i]).c_str());
        lv_dropdown_add_option(result.dd_mode_z, dd_mode_z_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_mode_z, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]);
    lv_obj_add_event_cb(result.dd_mode_z, dd_mode_z_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Critical for alignment
    lv_obj_set_size(result.label_z, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.ta_z, value_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_z, value_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_mode_z, label_width_1, LV_SIZE_CONTENT);
    
    /* --- Operator ------------------------------------------------------------ */
    
    lv_obj_t * row_operator = lv_obj_create(result.panel);
    lv_obj_set_size(row_operator, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_operator, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_operator, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_operator, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_operator, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_operator, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_operator,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_operator, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_operator, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_operator, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_operator, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 80;
    value_width_0 = ((width_px/2) - label_width_0) - padding*2;
    label_width_1 = 60;
    value_width_1 = ((width_px/2) - label_width_1) - padding*2;
    
    result.label_operator = lv_label_create(row_operator);
    lv_label_set_text(result.label_operator, "Operator");
    lv_obj_set_size(result.label_operator, label_width_0, row_height);
    lv_obj_set_style_text_font(result.label_operator, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_operator, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_operator, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    result.dd_operator = create_dropdown_menu(
        row_operator,
        NULL,
        0,
        value_width_0,
        row_height,
        LV_TEXT_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_operator_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_OPERATORS; i++) {
        snprintf(dd_operator_name, sizeof(dd_operator_name), "%s", matrixData.matrix_function_operator_name[i]);
        lv_dropdown_add_option(result.dd_operator, dd_operator_name, LV_DROPDOWN_POS_LAST);
    }
    // lv_dropdown_set_selected(result.label_operator, matrixData.matrix_switch_operator_index[0][current_matrix_i][current_matrix_function_i]);
    lv_obj_add_event_cb(result.dd_operator, dd_operator_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Inverted Logic Label
    result.label_inverted_logic = lv_label_create(row_operator);
    lv_label_set_text(result.label_inverted_logic, "Invert");
    lv_obj_set_size(result.label_inverted_logic, label_width_1, row_height);
    lv_obj_set_style_text_font(result.label_inverted_logic, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_inverted_logic, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_inverted_logic, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    // Inverted Logic Value
    result.dd_inverted_logic = create_dropdown_menu(
        row_operator,
        NULL,
        0,
        value_width_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_inverted_logic_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_FUNCTION_INVERTED_LOGIC_MODES; i++) {
        snprintf(
            dd_inverted_logic_name,
            sizeof(dd_inverted_logic_name),
            "%s",
            matrixData.inverted_logic_names[i]
        );
        lv_dropdown_add_option(result.dd_inverted_logic, dd_inverted_logic_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_inverted_logic, 0);
    lv_obj_add_event_cb(result.dd_inverted_logic, dd_inverted_logic_event_cb, LV_EVENT_VALUE_CHANGED, NULL);


    // Critical for alignment
    lv_obj_set_size(result.label_operator, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_operator, value_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.label_inverted_logic, label_width_1, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_inverted_logic, value_width_1, LV_SIZE_CONTENT);
    
    /* --- Output PWM ---------------------------------------------------------- */
    
    lv_obj_t * row_pwm0 = lv_obj_create(result.panel);
    lv_obj_set_size(row_pwm0, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_pwm0, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_pwm0, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_pwm0, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_pwm0, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_pwm0, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_pwm0,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );
    
    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_pwm0, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_pwm0, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_pwm0, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_pwm0, LV_DIR_NONE);}

