holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Row Object Widths
    label_width_0 = 80;
    value_width_0 = ((width_px) - label_width_0) - padding*2;
    label_width_1 = NULL;
    value_width_1 = NULL;

    result.label_output_pwm_0 = lv_label_create(row_pwm0);
    lv_label_set_text(result.label_output_pwm_0, "PWM0");
    lv_obj_set_size(result.label_output_pwm_0, label_width_0, row_height);
    lv_obj_set_style_text_font(result.label_output_pwm_0, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_output_pwm_0, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_output_pwm_0, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    result.ta_pwm_0 = create_textarea(
        row_pwm0,     // lv_obj_t
        value_width_0,             // width px
        row_height,              // height px
        LV_ALIGN_CENTER, // alignment
        0,            // pos x
        0,              // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_pwm_0, String(matrixData.output_pwm[0][current_matrix_i][INDEX_MATRIX_SWITCH_PWM_OFF]).c_str());
    lv_obj_add_event_cb(result.ta_pwm_0, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_pwm_0, &matrix_output_pwm_0_ctx);

    // Critical for alignment
    lv_obj_set_size(result.label_output_pwm_0, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.ta_pwm_0, value_width_0, LV_SIZE_CONTENT);

    /* --- Output PWM ---------------------------------------------------------- */
    
    lv_obj_t * row_pwm1 = lv_obj_create(result.panel);
    lv_obj_set_size(row_pwm1, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_pwm1, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_pwm1, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_pwm1, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_pwm1, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_pwm1, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_pwm1,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );
    
    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_pwm1, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_pwm1, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_pwm1, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_pwm1, LV_DIR_NONE);}

    // Row Object Widths
    label_width_0 = 80;
    value_width_0 = ((width_px) - label_width_0) - padding*2;
    label_width_1 = NULL;
    value_width_1 = NULL;

    result.label_output_pwm_1 = lv_label_create(row_pwm1);
    lv_label_set_text(result.label_output_pwm_1, "PWM1");
    lv_obj_set_size(result.label_output_pwm_1, label_width_0, row_height);
    lv_obj_set_style_text_font(result.label_output_pwm_1, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_output_pwm_1, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_output_pwm_1, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    result.ta_pwm_1 = create_textarea(
        row_pwm1,     // lv_obj_t
        value_width_0,             // width px
        row_height,              // height px
        LV_ALIGN_CENTER, // alignment
        0,            // pos x
        0,              // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_pwm_1, String(matrixData.output_pwm[0][current_matrix_i][INDEX_MATRIX_SWITCH_PWM_ON]).c_str());
    lv_obj_add_event_cb(result.ta_pwm_1, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_pwm_1, &matrix_output_pwm_1_ctx);

    // Critical for alignment
    lv_obj_set_size(result.label_output_pwm_1, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.ta_pwm_1, value_width_0, LV_SIZE_CONTENT);

    /* --- Index Map Slot ------------------------------------------------ */
    
    lv_obj_t * row_port = lv_obj_create(result.panel);
    lv_obj_set_size(row_port, LV_PCT(100), row_height);
    lv_obj_set_flex_flow(row_port, LV_FLEX_FLOW_ROW);
    lv_obj_set_style_pad_all(row_port, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(row_port, LV_OPA_TRANSP, LV_PART_MAIN);
    lv_obj_set_style_border_width(row_port, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_column(row_port, padding, LV_PART_MAIN);

    // Critical for alignment
    lv_obj_set_flex_align(
        row_port,
        LV_FLEX_ALIGN_START,   // main axis (left‑right)
        LV_FLEX_ALIGN_CENTER,  // cross axis (top‑bottom)
        LV_FLEX_ALIGN_CENTER   // track alignment
    );

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(row_port, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(row_port, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(row_port, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(row_port, LV_DIR_NONE);}
    
    // Row Object Widths
    label_width_0 = 35;
    value_width_0 = ((width_px/3) - label_width_0) - padding*2 - 10;
    label_width_1 = 0;
    value_width_1 = ((width_px/3) - label_width_1) - padding*2 + 20;
    label_width_2 = 35;
    value_width_2 = ((width_px/3) - label_width_2) - padding*2 -10;

    // Map Slot Label
    result.label_map_slot = lv_label_create(row_port);
    lv_label_set_text(result.label_map_slot, "Map");
    lv_obj_set_size(result.label_map_slot, label_width_0, row_height);
    lv_obj_set_style_text_font(result.label_map_slot, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_map_slot, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_map_slot, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    // Map Slot Value
    result.dd_map_slot = create_dropdown_menu(
        row_port,
        NULL,
        0,
        value_width_0,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_map_slot_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MAP_SLOTS; i++) {
        snprintf(dd_map_slot_name, sizeof(dd_map_slot_name), "%s", String(i).c_str());
        lv_dropdown_add_option(result.dd_map_slot, dd_map_slot_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_map_slot, matrixData.index_mapped_value[0][current_matrix_i]);
    lv_obj_add_event_cb(result.dd_map_slot, dd_link_map_slot_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Output Label
    result.label_output_mode = lv_label_create(row_port);
    lv_label_set_text(result.label_output_mode, "Out");
    lv_obj_set_size(result.label_output_mode, label_width_1, row_height);
    lv_obj_set_style_text_font(result.label_output_mode, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_output_mode, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_output_mode, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);

    // Output Value
    result.dd_output_mode = create_dropdown_menu(
        row_port,
        NULL,
        0,
        value_width_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_output_mode_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_OUTPUT_MODES; i++) {
        snprintf(dd_output_mode_name, sizeof(dd_output_mode_name), "%s", matrixData.output_mode_names[i]);
        lv_dropdown_add_option(result.dd_output_mode, dd_output_mode_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_output_mode, matrixData.output_mode[0][current_matrix_i]);
    lv_obj_add_event_cb(result.dd_output_mode, dd_output_mode_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Port Label
    result.label_port_map = lv_label_create(row_port);
    lv_label_set_text(result.label_port_map, "Pin");
    lv_obj_set_size(result.label_port_map, label_width_2, row_height);
    lv_obj_set_style_text_font(result.label_port_map, font_title, LV_PART_MAIN);
    lv_obj_set_style_text_color(result.label_port_map, default_title_hue, LV_PART_MAIN);
    lv_obj_set_style_text_align(result.label_port_map, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
    
    // Port Value
    result.ta_port_map = create_textarea(
        row_port,     // lv_obj_t
        value_width_2,             // width px
        row_height,              // height px
        LV_ALIGN_CENTER, // alignment
        0,            // pos x
        0,              // pos y
        true,            // one line
        LV_TXT_ALNUMDEC, // accepted char*
        "",              // placeholder text
        false,           // transparent bg
        false,           // show scrollbars
        false,           // enable scrolling
        font_sub,
        LV_TEXT_ALIGN_RIGHT
    );
    lv_textarea_set_text(result.ta_port_map, String(matrixData.matrix_port_map[0][current_matrix_i]).c_str());
    lv_obj_add_event_cb(result.ta_port_map, set_keyboard_context_cb, LV_EVENT_ALL, NULL);
    lv_obj_set_user_data(result.ta_port_map, &matrix_port_map_ctx);

    // Critical for alignment
    lv_obj_set_size(result.label_map_slot, label_width_0, LV_SIZE_CONTENT);
    lv_obj_set_size(result.dd_map_slot, value_width_0, LV_SIZE_CONTENT);

