holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Clean up title bar
    if (main_title_bar.panel) {
        // lv_obj_del(main_title_bar.panel);
        main_title_bar = {0};  // Reset struct
    }
    // Clean up system tray
    if (system_tray.panel) {
        // lv_obj_del(system_tray.panel);
        system_tray = {0};  // Reset struct
    }
    // Clean up keyboards
    if (kb_numdec.kb) {
        // lv_obj_del(kb_numdec.kb);
        kb_numdec = {0};  // Reset struct
    }
    if (kb_alnumsym.kb) {
        // lv_obj_del(kb_alnumsym.kb);
        kb_alnumsym = {0};  // Reset struct
    }

    // Clean up astro clock
    astro_clock_end();

    // Set background color for main part of the screen
    lv_obj_set_style_bg_color(scr, lv_color_make(0, 0, 0), LV_PART_MAIN);

    // -------------------------------- Keypad Num ------------------------------------ //

    // Create keyboard (bootstrapped)
    kb_numdec = create_keyboard(
        scr,            // lv_obj_t
        600,                    // width px
        250,                    // height px
        LV_ALIGN_CENTER,        // alignment
        0,                      // pos x
        23,                     // pos y
        10,                     // padding between kb and text area
        36,                     // text area height
        LV_KEYBOARD_MODE_NUMBER // keyboard mode
    );
    
    // Plug in keyboard callback for kb_numdec
    lv_obj_add_event_cb(kb_numdec.kb, keyboard_event_cb, LV_EVENT_VALUE_CHANGED, &kb_numdec);
    lv_obj_add_flag(kb_numdec.kb, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(kb_numdec.ta, LV_OBJ_FLAG_HIDDEN);

    // -------------------------------- Keyboard ----------------------------------- //

    // Create keyboard (bootstrapped)
    kb_alnumsym = create_keyboard(
        scr,            // lv_obj_t
        600,                    // width px
        250,                    // height px
        LV_ALIGN_CENTER,        // alignment
        0,                      // pos x
        23,                     // pos y
        10,                     // padding between kb and text area
        36,                     // text area height
        LV_KEYBOARD_MODE_USER_1 // keyboard mode
    );
    
    // Plug in keyboard callback for kb_alnumsym
    lv_obj_add_event_cb(kb_alnumsym.kb, keyboard_event_cb, LV_EVENT_VALUE_CHANGED, &kb_alnumsym);
    lv_obj_add_flag(kb_alnumsym.kb, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(kb_alnumsym.ta, LV_OBJ_FLAG_HIDDEN);

    // -------------------------------- Title Bar --------------------------------- //

    main_title_bar = create_title_bar(
        scr, // parent
        720, // width px
        80,  // height px
        LV_ALIGN_TOP_MID,
        0, // pos x
        0, // pos y
        false, // show scrollbar
        false  // enable scrollbar
    );

    // ------------------------------ System Tray --------------------------------- //

    // Create system tray
    system_tray = create_system_tray(scr);

    // Plug in event callback for screen click events
    lv_obj_add_event_cb(scr, screen_tap_cb, LV_EVENT_CLICKED, NULL);

    // Plug in event callback for screen swipe events
    lv_obj_add_event_cb(scr, screen_swipe_cb, LV_EVENT_GESTURE, NULL);
}

void display_loading_screen() {

    lv_obj_t * current_screen = lv_scr_act();

    if (!lv_obj_is_valid(loading_screen)) {loading_screen = lv_obj_create(NULL);}
    if (current_screen == loading_screen) return;

    lv_obj_set_style_bg_color(loading_screen, lv_color_make(0, 0, 0), LV_PART_MAIN);
    
    // Create image from sdcard and store reference for cleanup
    loading_image = create_image_from_sdcard(
        loading_screen,      // parent object
        "/sdcard/logo1.bin", // filepath
        600,                 // width_px
        600,                 // height_px
        16,                  // color_depth_bits
        0,                   // pos_x
        0,                   // pos_y
        LV_ALIGN_CENTER,     // alignment
        false                // keep in memory until cleanup
    );
    
    lv_scr_load(loading_screen);
}

/** ------------------------------------------------------------------
 * @brief Home Screen
 * 
 */
void display_home_screen() {

    // Set Display Flag
    flag_display_home_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == home_screen) {return;}

    // Always create a fresh screen
    home_screen = lv_obj_create(NULL);

    // Defaults
    default_screen_objects(home_screen);
    
    // Load screen before creating more objects (smoother, faster load)
    lv_scr_load_anim(home_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // -------------------------------- Astro Clock ----------------------------------- //

    // Initialize astro clock on main screen
    astro_clock_begin(
        home_screen,
        556,             // width px
        556,             // height px
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        90               // angle offset
    );

    lv_obj_invalidate(home_screen);  // Force redraw
    lv_timer_handler();  // Process events/render
}

/** ------------------------------------------------------------------
 * @brief Matrix Screen
 * 
 */
void display_matrix_screen() {

    // Set Display Flag
    flag_display_matrix_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == matrix_screen) {return;}

    // Always create a fresh screen
    matrix_screen = lv_obj_create(NULL);

    // Defaults
    default_screen_objects(matrix_screen);

    // Load screen before creating more objects (smoother, faster load)
    lv_scr_load_anim(matrix_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    matrix_overview_grid_1 = create_menu_grid(
        matrix_screen,        // parent screen
        15,                   // cols
        3,                    // rows
        30,                   // cell size px
        8,                    // outer padding
        8,                    // inner padding
        0,                    // pos x
        145,                  // pos y
        LV_ALIGN_TOP_MID,     // alignment
        radius_rounded,        // item radius px
        15,                   // max cols visible (for scrollbar)
        3,                    // max rows visible (for scrollbar)
        false,                // show scrollbar
        false,                // enable scrolling
        LV_TEXT_ALIGN_CENTER, // text align
        &cobalt_alien_17      // font for labels
    );
    // Plug in general event callback handler
    uint32_t grid_menu_x_count = lv_obj_get_child_cnt(matrix_overview_grid_1);
    for(uint32_t i = 0; i < grid_menu_x_count; i++) {
        lv_obj_t * btn = lv_obj_get_child(matrix_overview_grid_1, i);
        lv_obj_add_event_cb(btn, matrix_overview_grid_1_event_cb, LV_EVENT_CLICKED, NULL);
    }

    lv_obj_invalidate(matrix_screen);  // Force redraw
    lv_timer_handler();  // Process events/render

    // Create Function Panel
    mfc = create_matrix_function_container(
        matrix_screen,    // parent
        400,              // width px
        350,              // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        105,              // pos y
        radius_rounded,   // radius
        8,                // padding
        32,               // row height
        0,                // ror spacing
        false,            // show scrollbar
        false,            // enable scrolling
        &cobalt_alien_17, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    lv_obj_invalidate(matrix_screen);  // Force redraw
    lv_timer_handler();  // Process events/render

