holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Create Mapping Panel
    mcc = create_mapping_config_container(
        matrix_screen,    // parent
        400,              // width px
        350,              // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        105,              // pos y
        radius_rounded,   // radius
        8,                // padding
        32,               // row height
        0,                // ror spacing
        false,            // show scrollbar
        false,            // enable scrolling
        &cobalt_alien_17, // font for titles
        &cobalt_alien_17  // font for text
        
    );
    lv_obj_add_flag(mcc.panel, LV_OBJ_FLAG_HIDDEN);

    // Switch Panel View
    switch_matrix_mapping_panel = create_button(
        matrix_screen,        // parent
        80,                   // width
        56,                   // height
        LV_ALIGN_TOP_LEFT,    // alignment
        lv_obj_get_x(mfc.panel) - 110, // pos x
        lv_obj_get_y(mfc.panel),       // pos y
        "MATRIX",             // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded
    );
    lv_obj_add_event_cb(switch_matrix_mapping_panel.button, switch_matrix_mapping_panel_event_cb, LV_EVENT_ALL, NULL);

    lv_obj_invalidate(matrix_screen);  // Force redraw
    lv_timer_handler();  // Process events/render

    // Select Matrix File Slot
    dd_matrix_file_slot_select = create_dropdown_menu(
        matrix_screen,     // parent
        satioFileData.matix_filepaths, // menu items
        10,                // number of menu items
        240,               // width px
        34,                // height px
        LV_ALIGN_TOP_MID,  // alignment
        0,                 // pos x
        100,               // pos y
        &cobalt_alien_17   // font
    );
    for (int i=0; i<MAX_MATRIX_SLOTS; i++) {
        if (strcmp(satioFileData.current_matrix_filepath, satioFileData.matix_filepaths[i])==0) {
            lv_dropdown_set_selected(dd_matrix_file_slot_select, i);
            break;
        }
    }
    lv_obj_add_event_cb(dd_matrix_file_slot_select, dd_matrix_file_slot_select_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    lv_obj_invalidate(matrix_screen);  // Force redraw
    lv_timer_handler();  // Process events/render

    // New Matrix
    matrix_new = create_button(
        matrix_screen,        // parent
        34,                   // width px
        34,                   // height px
        LV_ALIGN_TOP_LEFT,    // alignment
        130,                  // pos x
        100,                  // pos y
        "N",                  // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded
    );
    lv_obj_add_event_cb(matrix_new.button, matrix_new_event_cb, LV_EVENT_ALL, NULL);

    // Save Matrix
    matrix_save = create_button(
        matrix_screen,        // parent
        34,                   // width px
        34,                   // height px
        LV_ALIGN_TOP_LEFT,    // alignment
        184,                  // pos x
        100,                  // pos y
        "S",                  // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded
    );
    lv_obj_add_event_cb(matrix_save.button, matrix_save_event_cb, LV_EVENT_ALL, NULL);

    // Load Matrix
    matrix_load = create_button(
        matrix_screen,        // parent
        34,                   // width px
        34,                   // height px
        LV_ALIGN_TOP_RIGHT,   // alignment
        -184,                 // pos x
        100,                  // pos y
        "L",                  // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded
    );
    lv_obj_add_event_cb(matrix_load.button, matrix_load_event_cb, LV_EVENT_ALL, NULL);

    // Delete Matrix
    matrix_delete = create_button(
        matrix_screen,        // parent
        34,                   // width px
        34,                   // height px
        LV_ALIGN_TOP_RIGHT,   // alignment
        -130,                 // pos x
        100,                  // pos y
        "D",                  // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded
    );
    lv_obj_add_event_cb(matrix_delete.button, matrix_delete_event_cb, LV_EVENT_ALL, NULL);


    lv_obj_invalidate(matrix_screen);  // Force redraw
    lv_timer_handler();  // Process events/render
}

/** ------------------------------------------------------------------
 * @brief GPS Screen
 * 
 */
void display_gps_screen() {

    // Set Display Flag
    flag_display_gps_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == gps_screen) {return;}

    // Always create a fresh screen
    gps_screen = lv_obj_create(NULL);

    // Defaults
    default_screen_objects(gps_screen);

    // Load screen before creating more objects (smoother, faster load)
    lv_scr_load_anim(gps_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);
}

/** ------------------------------------------------------------------
 * @brief Gyro Screen
 * 
 */
void display_gyro_screen() {

    // Set Display Flag
    flag_display_gyro_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == gyro_screen) {return;}

